app/views/work_orders/confirm_box_label.html.haml

SELECT "PRINTER"."UUID", "PRINTER"."CODE" FROM "PRINTER"
---

  = select_tag 'printer_id', options_from_collection_for_select(Printer.all.select(:uuid,:code), 'uuid', 'code', current_user.printer_id), class: 'select optional form-control'